{
  "code_of_conduct_url": null,
  "contributions_count": 0,
  "contribution_guidelines_url": null,
  "dependent_repos_count": 0,
  "dependents_count": 0,
  "deprecation_reason": null,
  "description": "Python-фреймворк, который позволяет создавать смартапы для виртуальных ассистентов Салют.",
  "forks": 0,
  "funding_urls": null,
  "homepage": null,
  "keywords": [],
  "language": null,
  "latest_download_url": null,
  "latest_release_number": "2.3.0rc33",
  "latest_release_published_at": "2024-11-15T10:48:37.000Z",
  "latest_stable_release_number": "2.2.0",
  "latest_stable_release_published_at": "2023-08-03T20:27:18.000Z",
  "license_normalized": true,
  "licenses": "",
  "name": "smart-app-framework",
  "normalized_licenses": [],
  "package_manager_url": "https://pypi.org/project/smart-app-framework/",
  "platform": "Pypi",
  "rank": 3,
  "repository_license": null,
  "repository_status": null,
  "repository_url": "",
  "security_policy_url": null,
  "stars": 0,
  "status": null,
  "versions": [
    {
      "number": "0.0.0",
      "published_at": "2022-12-16T09:49:00.432Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.0",
      "published_at": "2020-12-24T14:47:56.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.1",
      "published_at": "2021-01-20T13:04:28.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Sber Public License at-nc-sa v.2 (Attribution Non Commercial Share Alike version 1) Copyright© «Публичное акционерное общество «Сбербанк России» (Место нахождения: 117997, г.  Москва, ул. Вавилова, д. 19)»  Настоящая публичная открытая лицензия является лицензионны договором, предоставляющим  любому лицу, получившему копию Произведения (или Производного произведения), как это  определено ниже, право использования Произведения на условиях, изложенных ниже. Начиная использовать Произведение любым способом Вы принимаете все без исключения условия  Лицензии.  1.\tТермины, определения, общие положения.  1.1.\t«Адаптация» - внесение изменений в Произведение или в Производное произведение  исключительно в целях обеспечения функционирования Произведения на Ваших конкретных  технических средствах или под управлением конкретных программ, установленных у Вас на  оборудовании.  1.2.\t«Вы» (лицензиат данной Лицензии) - любое физическое (группа физических лиц – соавторы)  или юридическое лицо, получившее копию Произведения любым не противоречащим Закону  способом, в любой форме и на любом носителе информации; 1.2.1.\t«получатель» - любое физическое или юридическое лицо, получившее от Вас (или иного  лицензиата данной Лицензии) в рамках Распространения копию Произведения и/или  Производного произведения, созданного Вами (Вашего Производного произведения)  и/или иным лицензиатом данной Лицензии. Получатель также автоматически становится  лицензиатом данной Лицензии.  1.3.\t«Закон» - законодательство Российской Федерации, применяемое к правоотношениям,  возникающим между Вами и Сбербанком в рамках настоящей Лицензии;  1.4.\t«Лицензия» - настоящий лицензионный договор, предоставляющий право использования  Произведения и любых Производных произведений;  1.5.\t«Модификация» - внесение любых изменений в Произведение или в Производное  произведение за исключением Адаптации;  1.5.1.\t«Ваши изменения» - любые Модификации, внесенные Вами в Проведение или в  Производное произведение  1.6.\t«Произведение» -  программное обеспечение (программа для ЭВМ) и/или иное произведение,  написанное на языке программирования в форме объектного кода и/или исходного текста,  право использования которого предоставляется на условиях настоящей Лицензии, о чем  прямо указывается в сопроводительной документации и/или в программных файлах  соответствующего Произведения, и/или на Сайте Сбербанка, и/или в любом уведомлении,  сопровождающем Распространение Произведения. Исключительное право на Произведение  на основании Закона и в силу факта создания в полном объеме принадлежит Сбербанку;    1.7.\t«Производное произведение» - любой результат интеллектуальной деятельности, созданный  любым способом на основе и/или с использованием объектного кода и/или исходного текста  Произведения (в том числе, Производного произведения) в целом либо любой его части, в том  числе, путем Модификации. В целях применения положений настоящей Лицензии термин  «Ваше Производное произведение» входит в термин «Производное произведение», за  исключением случаев, когда из текста Лицензии прямо следует иное.  1.7.1.\t«Ваше Производное произведение» (также по тексту Лицензии – «Производные  произведения, созданные Вами») - Производное произведение, созданное Вами, в  отношении которого Вы являетесь автором и правообладателем ИЗМЕНЕНИЙ,  ВНЕСЕННЫХ лично Вами в Произведение (или иное Производное произведение,  созданное иным лицензиатом данной Лицензии) для создания Вашего Производного  произведения. Во избежание сомнений, так как условия настоящей Лицензии не  допускают сублицензирования Произведения и любого Производного произведения, а  также не позволяют передать исключительное право на любое Производное произведение  в полном объеме (см. Раздел 7 настоящей Лицензии) другому лицу, любое Производное  произведение, созданное по Вашему заказу любым третьим лицом, будет является  Производным произведение, созданным иным лицензиатом данной Лицензии, а не Вашим  Производным произведением.  1.7.2.\tВключение Произведения в подборку различных произведений исключительно в целях  хранения такой подборки на одном материальном носителе (или в памяти электронного  устройства / компьютера), в том числе, на котором Распространяется Произведение,  вместе с другими отдельными самостоятельными произведениями, которые не являются  Производными произведениями и не образуют вместе с Произведением Составного  произведения, не приводит к созданию Производного произведения. Такое включение  Произведения в указанную подборку не влечет применения положений настоящей  Лицензии к остальным самостоятельными произведениями.   1.8.\t«Распространение» - любая передача (в том числе, в любых целях) любой копии  Произведения (и/или Производного произведения) любым способом (в том числе, на любом  носителе информации) и в любой форме любому физическому и/или юридическому лицу,  государственному органу, любой общественной и/или международной организации, любому  учебному заведению или учреждению, в том числе, публикация, доведение до всеобщего  сведения или размещение (в том числе, размещение гиперссылки, позволяющей загрузить или  создать электронную копию Произведения / Производного произведения) в сети – Интернет;   1.9.\t«Составное произведение» - Производное произведение, созданное посредством объединения,  включения в состав, статического линкования, интеграции, компиляции (или иным  аналогичным способом) Произведения и/или Производного произведения (и/или их части) с  иным результатом интеллектуальной деятельности на уровне объектного кода и/или  исходного текста. В целях толкования положений настоящей Лицензии и во избежание каких- либо сомнений термин «Производное произведение» включает в себя Составное  произведение, если в Лицензии не указано иное;  1.10.\t«Сбербанк» - Публичное акционерное общество «Сбербанк России» (Место нахождения:  117997, г. Москва, ул. Вавилова, д. 19);  1.11.\t«Сайт Сбербанка» - официальный сайт Сбербанка в сети – Интернет по адресу:  1.12.\t«Официальный запрос Сбербанка» - запрос, направленный на Ваш адрес электронной почты,  указанный Вами в соответствии с пп. f) п.3.1.1 Лицензии, с адреса электронной почты,  заканчивающийся на «@sberbank.ru»   2.\tЛицензия.  2.1.\tНастоящим Сбербанк предоставляет Вам право использования Произведения на условиях  простой (неисключительную) не подлежащей передаче (сублицензированию) и переуступке  безвозмездной лицензии, действующей не территории всех стран Мира в течение срока  действия исключительного права Сбербанка, при условии соблюдения Вами всех положений  Лицензии.    2.2.\t Вы вправе использовать Произведение следующими способами: воспроизводить,  устанавливать, запускать, публично демонстрировать, использовать по функциональному  назначению, Модифицировать, Адаптировать, включать в состав собственного Составного  произведения, создавать Производные произведения, а также Распространять Произведения и  Производные произведения, при условии соблюдения положений Раздела 3 и 4 Лицензии. Вне  зависимости от определения термина «Распространение» и от иных положений Лицензии Вам  прямо запрещено сублицензировать, как Произведение, так и любое Производное  произведение, в том числе Ваше Производное произведение.  2.3.\tНастоящим Сбербанк также сделал предложение заключить договор об использовании  Произведения любым лицам, желающим использовать Производное произведение, созданное  Вами на основе Произведения, в пределах и на условиях, которые предусмотрены Лицензией.   2.4.\t Произведение лицензируется, а не продается. Вы не получаете никаких прав на Произведение  и Производное произведение за исключением тех, которые прямо указаны в настоящей  Лицензии. Вы обязуетесь не осуществлять каких-либо действий, связанных с получением  патента и/или иного правоустанавливающего и/или правоподтверждающего документа на  охраняемые и/или охраноспособные объекты интеллектуальных прав, включая, но не  ограничиваясь, изобретения, полезные модели, промышленные образцы,  реализованные/описанные в Произведении и/или Производном произведении. Все  интеллектуальные права, включая право на получение патента на охраняемые и/или  охраноспособные объекты интеллектуальных прав, реализованные/описанные в Произведении  и/или Производном произведении, принадлежат Сбербанку. Вам в рамках настоящей  Лицензии, не передаются и не предоставляются какие-либо патентные права на охраняемые  и/или охраноспособные объекты интеллектуальных прав.     3.\tУсловия Распространения.   3.1.\t Распространение в форме исходного текста.   3.1.1.\tВы вправе Распространять Производные произведения и/или неизмененные копии  Произведения в форме исходного текста только при условии, что любое такое  Распространение будет происходить исключительно на условиях настоящей Лицензии, а  также при условии соблюдения Вами следующих требований:   a)\tВы обязуетесь прикладывать к каждой копии Произведения и/или Производного  произведения текст настоящей Лицензии; b)\tВы обязуетесь в каждой копии Произведения и/или Производного произведения,  созданного иным лицензиатом данной Лицензии, сохранить без каких-либо изменений  все уведомления об авторском праве Сбербанка и иных  лицензиатов данной Лицензии,  создавших Производное произведение, включая все уведомления об отсутствии каких- либо гарантий в отношении Произведения и/или Производного произведения, а также  все уведомления о том, что использование Произведения и/или Производного  произведения разрешается только на условиях настоящей Лицензии;    c)\tВы обязуетесь добавить (при наличии – сохранить без каких-либо изменений) в любое  Ваше Производное произведение все без исключения и без каких-либо изменений  уведомления об авторском праве Сбербанка, действующие в отношении Произведения,  взятого за основу и/или использованного Вами при создании Производного  произведения, включая уведомления об отсутствии каких-либо гарантий со стороны  Сбербанка, а также все аналогичные уведомления (в случае их наличия и если  применимо) иных авторов, действующие в отношении Производного произведения,  взятого за основу и/или использованного Вами при создании Вашего Производного  произведения; d)\tВы обязуетесь добавить в любое Ваше Производное произведение список изменений,  внесенных Вами в Произведение и/или Производное произведение для создания  Вашего Производного произведения;  e)\tВы обязуетесь добавить в Ваше Производное произведение уведомление о том, что  правообладателем Вашего Производного произведения в части оригинального  исходного текста и объектного кода Произведения, использованного Вами при  создании Вашего Производного произведения и включенного в его состав, является  Сбербанк, а также уведомление о том, что Вы являетесь автором и правообладателем  только Ваших изменений, внесенных Вами в Произведение и/или Производное  произведение для создания Вашего Производного произведения (также, если  применимо, – сохранить все аналогичное уведомление иных лицензиатов настоящей  Лицензии, создавших Производное произведение), и о том, что использование Вашего  Производного произведения разрешается только на условиях настоящей Лицензии. Вы  обязаны Распространять любое Производное произведение только на условиях  настоящей Лицензии. Настоящая Лицензия применяться к Производному  произведению в целом и всем его частям, независимо от их комплектности и состава.  Настоящая Лицензия не дает права на Распространение любых Производны  произведений на любых иных условиях; f)\tПри Распространении Вашего Производного произведения Вы обязаны включить  (добавить) в каждый программный файл Вашего Производного произведения, а также в  файл со списком изменений, уведомление, содержащее Ваш актуальный адрес  электронной почты для связи с Вами, как с автором Вашего Производного  произведения. Вы также обязуетесь сохранять актуальность такого электронного  адреса в течение как минимум трех лет с даты первого Распространения  соответствующего Вашего Производного произведения.  g)\tЕсли Ваше Производное произведение имеет пользовательские интерфейсы, который  отображает уведомление о том, что Вы являетесь автором Вашего Производного  произведения, то Вы обязаны добавить также аналогичное (аналогичным способом)  уведомление об авторском праве Сбербанка (и, если применимо, иных авторов); h)\tВы можете Распространять копии Произведений и/или Производные произведения как  бесплатно, так и взимая плату за передачу экземпляра (копии Произведения и/или  копии Производного произведения), не превышающую Вашу себестоимость  Распространения;  Все уведомления, упомянутые в данном пункте, должны быть отражены в начале каждого  файла, содержащего исходный текст Произведения и/или Производного произведения, при  этом список извинений может быть представлен в виде отдельного файла формата «.txt»,  приложенного к файлам Произведения и/или Производного произведения.   3.2.\t Распространение в форме объектного кода.   3.2.1.\tВы вправе Распространять Производные произведения и/или неизмененные копии  Произведения в форме объектного кода только при условии, что любое такое  Распространение будет происходить исключительно на условиях настоящей Лицензии,  при условии соблюдения Вами всех без исключения требований, изложенных в п.3.1.1  настоящей Лицензии, а также следующих требований:   a)\tПри Распространении Производного произведения и/или неизменённой копии  Произведения в форме объектного кода на материальном носителе Вы обязаны также  Распространять каждому получателю полный (машиночитаемый) исходный текст  соответствующего Производного произведения и/или Произведения на основании  настоящей Лицензии и в соответствии с условиями настоящей Лицензии, одним из  следующих способов:  •\tв виде отдельного файла (набора файлов) на том же материальном носителе,  используемом Вами для Распространения Производного произведения и/или  Произведения; •\tпутем публикации на сайте в сети – Интернет, принадлежащем или  контролируемом Вами. При этом полный (машиночитаемый) исходный текст  соответствующего Производного произведения и/или Произведения должен  быть доступен для копирования и скачивания с Вашего сайта в сети – Интернет  неограниченному кругу лиц в течение не менее трех лет с даты первого  Распространения без необходимости какой-либо регистрации и/или авторизации  на Вашем сайте, а также без взимания какой-либо платы за посещение Вашего  сайта и/или скачивание / копирование такого исходного теста. В таком случае,  Вы обязаны сопровождать Распространение Производного произведения и/или  Произведения в форме объектного кода надлежащим и явно заметным  уведомлением о том, что получатель вправе в любой момент скачать или  скопировать исходный текст соответствующего Производного произведения  и/или Произведения с Вашего сайта в сети Интернет. Такое уведомление  должно содержать актуальную и работающую гиперссылку на  соответствующий исходный текст; •\tесли это технически возможно, путем направления отдельного файла (набора  файлов) получателю Производного произведения и/или Произведения на его  адрес электронной почты по его первому запросу; В таком случае, Вы обязаны  сопровождать Распространение Производного произведения и/или  Произведения в форме объектного кода надлежащим и явно заметным  уведомлением о том, что получатель вправе в любой момент запросить у Вас  файл (файлы) исходного текста соответствующего Производного произведения  и/или Произведения; •\tпутем размещения в облачном хранилище данных (на сетевом ресурсе третьих  лиц) с последующим направлением любому получателю по его первому запросу  на его адрес электронной почты гиперссылки, позволяющей бесплатной и без  какой-либо регистрации и/или авторизации копировать и/или скачать исходный  текст Производного произведения и/или Произведения с такого облачного  хранилища данных в течение трех лет с даты первого Распространения. В таком  случае, Вы обязаны сопровождать Распространение Производного произведения  и/или Произведения в форме объектного кода надлежащим и явно заметным  уведомлением о том, что получатель вправе в любой момент запросить у Вас  гиперссылку, позволяющую осуществить скачивание или копирование  исходного текста соответствующего Производного произведения и/или  Произведения;  b)\tВ случае Распространения объектного кода Производного произведения и/или  Произведения в электронном виде Вы обязаны Распространять полный  (машиночитаемый) исходный текст таких Производный произведений и/или  Произведения на основании настоящей Лицензии и в соответствии с условиями  настоящей Лицензии всем получателям соответствующего объектного кода тем же  способом, что и соответствующий объектный код; c)\tВ случае Распространения Производного произведения и/или Произведения в памяти  любого электронного устройства или компьютера в качестве предустановленного  программного обеспечения Вы обязаны Распространять полный (машиночитаемый)  исходный текст таких Производный произведений и/или Произведений на основании  настоящей Лицензии и в соответствии с условиями настоящей Лицензии всем  получателям таких устройств или компьютеров любым из способов, указанных в пп. a)  п.3.2.1 настоящей Лицензии, сопровождая такое Распространение соответствующим  уведомлением о том, как получатель может получить соответствующий полный  (машиночитаемый) исходный текст.  d)\tВ случае Распространения Производного произведения и/или Произведения в форме  объектного кода путем размещения (публикации) на любом сайте в сети – Интернет Вы  обязаны разместить вместе с таким объектным кодом полный (машиночитаемый)  исходный текст соответствующего Производного произведения и/или Произведения на  основании настоящей Лицензии и в соответствии с условиями настоящей Лицензии. e)\tЛюбое Распространение Производного произведения и/или Произведения в форме  объектного кода должно сопровождаться соответствующими уведомлениями о том, что  использование такого Производного произведения и/или Произведения, как в форме  объектного кода, так и в форме исходного текста, допускается только на основании и  условиях настоящей Лицензии, о том, как получатель может получить  соответствующий полный (машиночитаемый) исходный текст и об исключении каких- либо гарантий со стороны Сбербанка (если применимо - с Вашей стороны и/или со  стороны иных лицензиатов данной Лицензии), а также должно сопровождаться полным  текстом настоящей Лицензии и уведомлением об авторском праве Сбербанка (если  применимо – о Вашем авторском праве и/или авторском праве иных лицензиатов  данной Лицензии). f)\tОсуществляя любое Распространение Производного произведения и/или Произведения  в форме объектного кода Вы обязаны соблюдать и выполнять все требования, указные  в п. 3.1.1 настоящей Лицензии, применяя их как к Распространению Производного  произведения и/или Произведения в форме объектного кода, так и к Распространению  полного (машиночитаемого) исходного текста таких Производных произведений и/или  Произведения. Во избежание каких-либо сомнений, все требования, указанные в п.3.1.1  настоящей Лицензии, применяются при Вашем Распространении Производного  произведения и/или Произведения в форме объектного кода в дополнение к  требованиям, изложенным в настоящем пункте 3.2.1 Лицензии, так как любое  Распространение Производного произведения и/или Произведения в форме объектного  кода должно сопровождаться Распространением Производного произведения и/или  Произведения в форме исходного текста. g)\tВы обязаны предоставить полный (машиночитаемый) исходный текст Производного  произведения, созданного Вами, по первому Официальному запросу Сбербанка,  способом, указанным Сбербанков в таком Официальном запросе Сбербанка. Передача  в электронной форме должна происходить без какой-либо оплаты со стороны  Сбербанка. В случае передачи на материальном носителе (если это Ваш материальны  носитель, а не материальный носитель, предоставлены Вам Сбербанком для такой  передачи) Вы праве потребовать от Сбербанка оплату стоимости материального  носителя (при этом, стоимость такого материального носителя не может превышать его  реальную рыночную стоимость).   3.2.2.\tВсе уведомления, предусмотренные п.3.1.1 настоящей Лицензии в отношении исходного  текста Произведения и/или Производного произведения, должны быть добавлены (или  сохранены) и в отношении объектного кода Произведения и/или соответствующего  Производного произведения в любой документации, которой сопровождается  соответствующее Распространение.  3.3.\tСтоимость любой копию, которую Вы Распространяете, не может превышать стоимость  материального носителя, на котором Вы Распространите такую копию (в случае  Распространения в электронном виде – стоимость, соответствующую Вашим реальным  фактическим расходам на такое Распространение).   4.\tПрекращение действия и отзыв Лицензии.  4.1.\tСбербанк вправе в одностороннем порядке полностью или частично отказаться от Лицензии  если Вы будите Распространять третьим лицам Произведение либо любые Производные  произведения на иных условиях, чем те, которые предусмотрены настоящей Лицензией.  Любая Ваша попытка Распространения Произведения и/или Производного произведения, или  создания Производного произведения на иных условиях является ничтожной и автоматически  прекращает Ваше право использования Произведения и любого Производного произведения,  предоставленное Вам по настоящей Лицензии. Прекращение Вашего права использования  (Вашей Лицензии), не прекращает действие Лицензий иных лиц, которые получили от Вас  точные копии Произведения или Производные проведения права, если такие копии или  Производные произведения были получены в результате Распространения, отвечающего всем  условиям настоящей Лицензии.  4.2.\t Сбербанк вправе в любой момент и без объяснения причин отозвать у Вас данную Лицензию,  если использование Вами Произведения и/или Производного произведения нарушает права  и/или законные интересы третьих лиц, осуществляется в нарушение (в целях нарушения,  направлено на нарушение, способствует нарушению, вызывает нарушение, может привести  (или ведет) к нарушению) Закона, общественных (публичных) интересов и/или  законодательства страны, в которой Вы осуществляете такое использованием.  4.3.\t Лицензия автоматически расторгается (прекращает свое действие) в случае любого  нарушения Вами ее условий. Лицензия считается расторгнутой (прекратившей свое действие)  с момента нарушения Вами любого ее условия. Дальнейшее использование Произведения  и/или Производного произведения будет являться неправомерным.    5.\tОтсутствие гарантий.  5.1.\tПроизведения и Производные произведения предоставляются исключительно на условиях  «КАК ЕСТЬ» - БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ со стороны Сбербанка (и заверений), как  явных, так и подразумеваемых, в том числе (включая, но не ограничиваясь), относительно их  работоспособности, товаропригодности, функционирования, функциональности,  безопасности, пригодности для определенных целей и/или соответствия каким-либо Вашим  ожиданиям или ожиданиям иных третьих лиц.  5.2.\t Сбербанк, в рамках настоящей Лицензии, не осуществляет и не обязуется осуществлять  какое-либо гарантийное обслуживание и/или техническую поддержку Произведения и/или  любого Производного произведения.  6.\tОграничение ответственности.  6.1.\tНи при каких условиях Сбербанк НЕ НЕСЕТ ответственности перед Вами и какими-либо  третьими лицами за убытки, включая любые прямые, косвенные, умышленные, случайные  или последующие убытки любого характера проистекающие из данной Лицензии или из  использования или невозможности использования Произведения и/или Производного  произведения (включая, но, не ограничиваясь, убытками, возникшими в результате потери  деловой репутации, прекращения работы, технического сбоя, аварии или неисправности или  любых коммерческих убытков, издержек или потерь, а равно упущенной выгоды или  неосновательного обогащения) даже если Сбербанку было известно или должно было быть  известно о возможности таких убытков или Вы были предупреждены о возможности таких  убытков. 6.2.\tСбербанк в случае, если исключительное право на Произведение и/или Производное  произведение будет нарушено Вашими неправомерными действиями по использованию  Лицензии, вправе требовать применения к Вам мер защиты исключительного права в  соответствии с Законом.  7.\tИнтеллектуальные права.   Для того, чтобы любой желающий мог бесплатной пользоваться и постоянно развивать,  поддерживать, улучшать, модернизировать, совершенствовать, поддержания актуальности  Произведение, Ваши Производные произведения и любые Производные произведением,  созданным иными лицензиатами данной Лицензии, а также создавать собственные работы и  решения, развивая и обогащая тем самым IT – отрасль, улучшая и облегчая жизнь  потребителей и получателей, требуется установить четкое разграничения принадлежности  исключительного права. В ином случае любое лицо, действуя недобросовестными, но в  рамках Закона (или иного применимого права), сможет завладеть исключительным правом на  Производное произведение в полном объеме, что в свою очередь может привести, как к  судебным искам в адрес получателей Вашего Производного произведения и/или Ваш адрес,  так и приостановке (прекращению) дальнейшего развития Произведения, Ваших  Производных произведений и/или любых Производных произведений в целом.     7.1.1.\tИсключительное право на любое Производное произведение, созданное Вами (Ваше  Производное произведение) и/или иным лицензиатом данной Лицензии, в части  оригинального исходного текста и/или объектного кода Произведения, использованного  Вами (и/или любым иным лицензиатом данной Лицензии) при создании любого  Производного произведения и содержащегося в таком Производном произведении, в  полном объеме и без каких-либо ограничений принадлежит Сбербанку с момента (даты)  создания (с момента выражения в объективной форме) такого Производного произведения.  Сбербанк в полном объеме сохраняет свое исключительно право на весь без исключения  оригинальный исходный текст и объектный код Произведения, использованный Вами  (и/или любым иным лицензиатом данной Лицензии) при создании любого Производного  произведения (и всех без исключения последующих Производных произведений) и  содержащийся в любом таком Производном произведении, созданном Вами (в Вашем  Производном произведении) и/или любым иным лицензиатом данной Лицензии. Вы  вправе использовать и Распространять Производное произведение, созданное Вами (Ваше  Производное произведение) и/или любым иным лицензиатом данной Лицензии, только на  условиях и на основании данной Лицензии. Настоящим Вы, как автор и правообладатель  изменений, внесенных лично Вами в Произведение (или в иное Производное  произведение, созданное иным лицензиатом данной Лицензии) для создания Вашего  Производного произведения), предоставляете всем без исключения получателям Вашего  Производного произведения, право использования таких изменений, внесенных Вами в  Произведение (или Производное произведение, созданное иным лицензиатом данной  Лицензии) для создания Вашего Производного произведения, на условиях и в  соответствии с данной Лицензий без выплаты Вам (в том числе, иному лицензиату данной  Лицензии или какому либо третьему лицу) какого-либо вознаграждения за такое  использование.  7.1.2.\tНастоящим Вы также предоставляете персонально Сбербанку право использования всех  без исключения Ваших изменений, внесенных Вами в Произведение (или в иное  Производное произведение, созданное иным лицензиатом данной Лицензии) для создания  Вашего Производного произведения), но на условиях простой (неисключительной)  безвозмездной (без выплаты Вам какого-либо вознаграждения за право использования)  лицензии действующей, в течение всего срока действия Вашего авторского  (исключительного) права на Ваши изменения и на территории стран всего Мира, в любых  целях, любыми способами, в том числе, указанными в статье 1270 Гражданского кодекса  Российской Федерации, включая, но не ограничиваясь, следующими: внесение изменений  (Модификация / иная переработка), в том числе, для создания Производных произведений  (в том числе, включающих Ваши изменения), Распространение, Адаптация, оказание услуг  посредством и/или с использованием Ваших изменений (и/или функционала Ваших  изменений). При этом, Исключительное право на любое Производное произведение,  созданное Сбербанком (в том числе, с использованием и/или на основе Ваших изменений),  включая весь без исключения исходный текст и/или объектный код, включенный в состав  такого Производного произведения, созданного Сбербанком (включая исходный текст  и/или объектный код Ваших изменений, включенный Сбербанком в состав такого  Производного произведения, созданного Сбербанком), в полном объеме и без каких-либо  ограничений принадлежит Сбербанку с момента (с даты) создания (с момента выражения в  объективной форме) такого Производного произведения, созданного Банком.  Во избежание каких – либо сомнений, Производные произведения, созданные Сбербанком  (в том числе, включающие Ваши изменения, не входят в предмет настоящей Лицензии, но  могут предоставляться и/или Распространяться Сбербанком на условиях, как настоящей  Лицензии, так и на условиях иных лицензионных договоров (по усмотрению Сбербанка), в  том числе, возмездных.  7.1.3.\tВ отношении Вашего Производного произведения Вы вправе добавить (не изменяя, а лишь  дополняя уведомление Сбербанка об авторском праве) собственное уведомление о Вашем  авторстве по следующей форме:  «____(Ваше имя (и если применимо, также название Вашей организации, работником  которой Вы являетесь) и Ваш адрес электронной почты) является автором настоящего  произведения «_(название Производного произведения)_», созданного на основе «_(название  оригинального Произведения или Производного произведения, взятого за основу)»    7.1.4.\tСбербанк всегда полагается на Вашу добросовестность при использовании Произведений  и Производных произведений, как созданных Вами, так и иными лицензиатами, и при  соблюдении условий настоящей Лицензии, однако, связи с тем, что настоящая Лицензия,  является фактически открытой лицензией и допускает создание неограниченного числа  Производных произведений, Сбербанк не может быть уверенным в том, что Вы сохранили  все уведомления об авторстве создателей Производных произведений. В связи с  вышеизложенным обстоятельством и во избежание возможных претензий со стороны  авторов Производных произведений:     •\tНастоящим Вы, как автор Производного произведения, созданного Вами, даете свое  согласие и разрешение Сбербанку не упоминать Вас в качестве автора Производного  произведения, созданного Вами, при любом использовании Сбербанком Производного  произведения, созданного Вами, а также разрешаете Сбербанку по его усмотрению  использовать или не использовать название Производного произведения, созданного  Вами.   •\tНастоящим Вы, как работодатель автора Производного произведения, обязуетесь  получить от своего работника в пользу Сбербанка согласие и разрешение не упоминать  Вашего работника автора Производного произведения при любом использовании  Сбербанком Производного произведения, созданного Вами, а также передать  Сбербанку соответствующее согласие и разрешение по первому Официальному  запросу Сбербанка. Вы также даете Сбербанку разрешение по его усмотрению  использовать или не использовать название Производного произведения, созданного  Вами.  7.1.5.\tПри любом Распространении Произведения и/или Производного произведения Вы  обязуетесь не добавлять / не включать в Произведение и/или Производное произведение  эффективные технические средства, удовлетворяющие требованиям любого закона или  нормативного акта, принятого во исполнение обязательств, предусмотренных статьей 11  Договора ВОИС по авторскому праву от 20 декабря 1996 года или аналогичных законов,  запрещающих или ограничивающих обход таких технических средств. Вы также  обязуетесь не ограничивать (любым способом, в том числе, посредством добавления  соответствующих эффективных технических средств ограничения) функционирование  Произведения и/или любых Производных произведений или их функционал.  7.1.6.\tПри каждом Распространении Произведения и/или Производного произведения,  совершённом Вами в соответствии с условиями данной Лицензии, получатель  автоматически получает от Сбербанка право использования соответствующего  Произведения (или его части), в том числе, использованного Вами при создании  Производного произведения на условиях настоящей Лицензии и становится лицензиатом в  рамках Лицензии. Вы не несете ответственности за соблюдение условий настоящей  Лицензии любыми третьими лицами (в том числе, иными лицензиатами и получателями).  7.1.7.\tВы не вправе при любом Распространении Произведения и/или Производного  произведения налагать какие-либо дополнительные ограничения и применять какие-либо  дополнительные условия, ограничивающие, расширяющие или иным образом  изменяющие объем прав, предоставляемый настоящей Лицензией.  7.1.8.\tЕсли на Вас наложены обязанности или обязательства (например, в силу решений суда, в  рамках какого-либо договора с третьим лицами, законодательством страны, в которой Вы  постоянно проживаете или зарегистрированы, или в которой Вы осуществляете  Распространение (или иное использование) Произведения и/или Производного  произведения, и в силу т.п. условий и факторов), которые не позволяют Вам соблюдать  определенные условия данной Лицензии, то Вы не вправе принимать условия данной  Лицензию и не вправе каким-либо образом использовать Произведение и/или Производное  произведение, и должны незамедлительно прекратить любое такое использование, так как  оно будет являться неправомерным. Данная Лицензия заключается с Вами и Сбербанк  предоставляет Вам право использования Произведения и Производных произведений  только при условии, что на Вас не наложены указанные выше обязанности или  обязательства. Начиная использовать Произведение и/или любое Производное  произведение вы тем самым подтверждаете и гарантируете, что на Вас не наложены  соответствующие обязанности или ограничения. Если указанные обязанности или  обязательства не позволяют Вам соблюдать условия Лицензии, связанные с  Распространение Произведения и/или Производных произведений, то Вы не вправе  осуществлять какое-либо Распространение Произведения и/или Производного  произведения.",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.2",
      "published_at": "2021-02-02T08:58:56.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.2rc1",
      "published_at": "2021-01-22T11:38:10.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.3",
      "published_at": "2021-03-24T12:27:57.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.3rc1",
      "published_at": "2021-02-02T10:25:15.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.3rc2",
      "published_at": "2021-02-03T09:47:31.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.3rc3",
      "published_at": "2021-02-16T14:51:54.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.3rc4",
      "published_at": "2021-02-19T10:16:34.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.3rc5",
      "published_at": "2021-02-26T11:45:04.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.3rc6",
      "published_at": "2021-03-01T12:42:14.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.3rc7",
      "published_at": "2021-03-11T10:54:22.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.3rc8",
      "published_at": "2021-03-18T09:18:02.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.4",
      "published_at": "2021-04-26T10:48:53.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.4rc1",
      "published_at": "2021-03-30T14:05:37.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.4rc2",
      "published_at": "2021-04-05T12:04:34.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.4rc3",
      "published_at": "2021-04-06T10:18:11.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.4rc4",
      "published_at": "2021-04-13T10:15:50.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.4rc5",
      "published_at": "2021-04-16T09:24:15.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.4rc6",
      "published_at": "2021-04-19T13:53:40.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.5",
      "published_at": "2021-05-14T04:12:42.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.5rc1",
      "published_at": "2021-05-13T08:56:34.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.5rc2",
      "published_at": "2021-05-13T14:00:39.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.6",
      "published_at": "2021-07-26T08:20:44.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.6rc1",
      "published_at": "2021-06-04T14:44:10.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.6rc10",
      "published_at": "2021-07-15T15:49:38.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.6rc2",
      "published_at": "2021-06-07T11:47:33.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.6rc3",
      "published_at": "2021-06-08T11:27:53.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.6rc4",
      "published_at": "2021-06-10T17:10:36.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.6rc5",
      "published_at": "2021-06-17T08:42:43.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.6rc6",
      "published_at": "2021-06-18T08:23:58.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.6rc7",
      "published_at": "2021-06-22T12:53:16.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.6rc8",
      "published_at": "2021-07-05T15:10:20.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.6rc9",
      "published_at": "2021-07-08T07:30:18.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7",
      "published_at": "2022-02-04T13:54:56.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc1",
      "published_at": "2021-07-26T09:02:32.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc10",
      "published_at": "2021-09-28T14:26:33.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc11",
      "published_at": "2021-10-05T11:15:09.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc12",
      "published_at": "2021-11-23T11:49:51.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc13",
      "published_at": "2021-11-26T12:09:12.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc14",
      "published_at": "2021-12-09T10:24:22.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc15",
      "published_at": "2021-12-09T15:22:55.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc16",
      "published_at": "2021-12-13T14:39:06.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc17",
      "published_at": "2021-12-16T15:49:57.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc18",
      "published_at": "2021-12-17T11:40:21.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc19",
      "published_at": "2021-12-20T10:02:10.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc2",
      "published_at": "2021-08-05T14:31:23.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc20",
      "published_at": "2021-12-20T15:01:38.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc21",
      "published_at": "2021-12-21T10:15:34.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc22",
      "published_at": "2021-12-24T08:17:55.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc23",
      "published_at": "2022-01-11T07:30:46.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc24",
      "published_at": "2022-01-31T15:14:40.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc25",
      "published_at": "2022-02-04T13:24:31.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc3",
      "published_at": "2021-08-18T14:07:58.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc4",
      "published_at": "2021-08-27T12:49:38.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc5",
      "published_at": "2021-09-01T11:35:33.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc6",
      "published_at": "2021-09-14T14:04:06.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc7",
      "published_at": "2021-09-14T14:34:30.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc8",
      "published_at": "2021-09-15T06:54:45.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.7rc9",
      "published_at": "2021-09-15T14:41:17.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8",
      "published_at": "2022-09-27T22:36:05.803Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc1",
      "published_at": "2022-02-14T11:27:27.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc10",
      "published_at": "2022-04-27T07:57:44.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc11",
      "published_at": "2022-05-14T05:49:41.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc12",
      "published_at": "2022-05-18T09:32:47.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc13",
      "published_at": "2022-05-19T07:54:31.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc14",
      "published_at": "2022-06-21T09:01:41.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc15",
      "published_at": "2022-07-11T09:00:22.218Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc16",
      "published_at": "2022-07-12T09:13:00.342Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc17",
      "published_at": "2022-08-02T08:58:12.629Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc18",
      "published_at": "2022-08-19T09:30:28.505Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc19",
      "published_at": "2022-08-19T11:18:00.453Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc2",
      "published_at": "2022-02-14T12:07:06.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc20",
      "published_at": "2022-08-22T13:57:09.385Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc21",
      "published_at": "2022-08-25T14:12:01.611Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc22",
      "published_at": "2022-08-31T12:01:05.112Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc23",
      "published_at": "2022-09-07T06:14:07.547Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc24",
      "published_at": "2022-09-09T06:43:10.101Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc25",
      "published_at": "2022-09-21T09:32:03.586Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc26",
      "published_at": "2022-09-26T10:14:05.176Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc3",
      "published_at": "2022-03-09T13:09:19.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc4",
      "published_at": "2022-03-21T07:17:46.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc5",
      "published_at": "2022-03-23T07:09:01.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc6",
      "published_at": "2022-03-23T08:56:07.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc7",
      "published_at": "2022-04-01T06:44:56.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc8",
      "published_at": "2022-04-04T09:13:50.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.8rc9",
      "published_at": "2022-04-04T12:24:10.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "sberpl-2",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc1",
      "published_at": "2022-09-30T08:41:11.158Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc10",
      "published_at": "2022-11-25T16:50:00.432Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc11",
      "published_at": "2022-12-01T06:49:00.925Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc12",
      "published_at": "2022-12-12T13:09:00.589Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc13",
      "published_at": "2022-12-14T11:44:03.168Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc14",
      "published_at": "2022-12-16T10:13:00.570Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc15",
      "published_at": "2022-12-23T08:11:00.910Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc16",
      "published_at": "2023-02-13T11:00:00.977Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc17",
      "published_at": "2023-02-20T14:27:00.758Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc18",
      "published_at": "2023-03-07T13:49:00.862Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc3",
      "published_at": "2022-09-30T12:32:01.984Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc4",
      "published_at": "2022-10-07T14:43:04.609Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc5",
      "published_at": "2022-10-19T13:35:15.242Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc6",
      "published_at": "2022-10-19T13:47:07.034Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc7",
      "published_at": "2022-11-14T23:28:00.419Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc8",
      "published_at": "2022-11-21T07:57:08.877Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.9rc9",
      "published_at": "2022-11-23T11:32:01.159Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.2.0rc1",
      "published_at": "2023-06-08T12:38:00.870Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0",
      "published_at": "2023-02-15T13:11:00.474Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc1",
      "published_at": "2022-12-27T13:06:00.656Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc10",
      "published_at": "2023-02-08T10:27:51.792Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc11",
      "published_at": "2023-02-08T13:04:00.452Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc12",
      "published_at": "2023-02-09T10:48:02.943Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc13",
      "published_at": "2023-02-09T11:26:04.959Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc14",
      "published_at": "2023-02-09T11:51:07.929Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc15",
      "published_at": "2023-02-13T10:07:57.774Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc16",
      "published_at": "2023-02-13T14:27:56.977Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc2",
      "published_at": "2022-12-28T12:05:58.557Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc3",
      "published_at": "2022-12-29T14:30:02.481Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc4",
      "published_at": "2023-01-09T22:14:04.983Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc5",
      "published_at": "2023-01-09T22:49:35.745Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc6",
      "published_at": "2023-01-23T13:39:03.798Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc7",
      "published_at": "2023-01-23T16:00:01.320Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc8",
      "published_at": "2023-01-26T14:14:00.448Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.0rc9",
      "published_at": "2023-01-26T15:01:27.695Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.1",
      "published_at": "2023-05-10T12:58:00.796Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.1rc1",
      "published_at": "2023-02-20T14:29:01.476Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.1rc10",
      "published_at": "2023-04-24T09:45:01.105Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.1rc11",
      "published_at": "2023-05-04T21:10:00.429Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.1rc2",
      "published_at": "2023-03-07T09:40:58.032Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.1rc3",
      "published_at": "2023-03-21T10:44:00.781Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.1rc4",
      "published_at": "2023-03-24T11:25:58.962Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.1rc5",
      "published_at": "2023-03-29T06:08:06.116Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.1rc6",
      "published_at": "2023-03-29T11:00:00.522Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.1rc7",
      "published_at": "2023-04-17T16:18:00.683Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.1rc8",
      "published_at": "2023-04-18T16:39:01.594Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.1rc9",
      "published_at": "2023-04-19T15:45:59.402Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.0.2rc1",
      "published_at": "2023-05-12T08:12:00.554Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.1.0",
      "published_at": "2023-05-26T07:45:00.995Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.1.1rc1",
      "published_at": "2023-05-31T16:15:41.522Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.1.1rc2",
      "published_at": "2023-06-03T13:35:00.757Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.1.1rc3",
      "published_at": "2023-06-07T14:33:00.701Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.1.1rc4",
      "published_at": "2023-06-07T21:19:04.400Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.2.0",
      "published_at": "2023-08-03T20:27:18.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.2.0rc1",
      "published_at": "2023-06-08T14:50:00.431Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.2.0rc2",
      "published_at": "2023-06-14T11:41:04.420Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.2.0rc3",
      "published_at": "2023-06-19T14:01:22.253Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.2.0rc4",
      "published_at": "2023-06-23T08:49:00.814Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.2.0rc5",
      "published_at": "2023-06-23T14:06:02.651Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.2.0rc6",
      "published_at": "2023-07-04T14:25:00.366Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.2.0rc7",
      "published_at": "2023-07-13T15:25:02.151Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.2.0rc8",
      "published_at": "2023-07-24T16:17:03.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc1",
      "published_at": "2023-08-07T10:32:59.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc10",
      "published_at": "2023-10-09T13:51:49.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc11",
      "published_at": "2023-10-10T10:51:46.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc12",
      "published_at": "2023-10-13T17:42:20.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc13",
      "published_at": "2023-10-26T11:41:21.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc14",
      "published_at": "2023-10-30T14:20:05.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc15",
      "published_at": "2023-10-31T10:07:41.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc16",
      "published_at": "2023-11-02T14:35:50.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc17",
      "published_at": "2023-11-08T08:33:06.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc18",
      "published_at": "2023-11-09T10:48:32.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc19",
      "published_at": "2023-11-10T08:21:03.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc2",
      "published_at": "2023-08-08T17:20:59.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc20",
      "published_at": "2023-11-16T15:54:00.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc21",
      "published_at": "2023-11-19T22:44:14.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc22",
      "published_at": "2023-11-20T09:25:38.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc23",
      "published_at": "2023-11-20T09:35:53.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc24",
      "published_at": "2023-11-21T13:00:53.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc25",
      "published_at": "2023-12-11T15:20:31.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc26",
      "published_at": "2023-12-13T10:41:50.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc27",
      "published_at": "2024-01-11T09:19:13.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc28",
      "published_at": "2024-02-19T13:43:46.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc29",
      "published_at": "2024-03-11T11:01:34.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc3",
      "published_at": "2023-08-08T22:02:22.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc30",
      "published_at": "2024-03-19T09:58:04.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc33",
      "published_at": "2024-11-15T10:48:37.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc36",
      "published_at": "2024-11-15T10:45:11.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc37",
      "published_at": "2024-11-15T10:45:12.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc38",
      "published_at": "2024-11-15T10:45:17.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc39",
      "published_at": "2024-11-15T10:43:48.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc4",
      "published_at": "2023-08-08T22:21:24.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc5",
      "published_at": "2023-08-10T22:16:57.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc6",
      "published_at": "2023-08-22T14:06:04.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc7",
      "published_at": "2023-08-25T11:24:22.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc8",
      "published_at": "2023-08-25T11:55:15.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.3.0rc9",
      "published_at": "2023-10-02T12:02:30.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc10",
      "published_at": "2023-11-23T08:17:13.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc11",
      "published_at": "2023-12-01T13:04:31.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc12",
      "published_at": "2024-01-09T14:14:57.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc13",
      "published_at": "2024-01-15T15:15:04.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc14",
      "published_at": "2024-02-08T16:11:11.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc15",
      "published_at": "2024-02-09T14:51:03.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc16",
      "published_at": "2024-02-19T13:35:23.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc17",
      "published_at": "2024-03-05T08:45:38.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc18",
      "published_at": "2024-03-19T10:03:13.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc19",
      "published_at": "2024-03-29T09:42:20.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc20",
      "published_at": "2024-08-12T11:30:39.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc200",
      "published_at": "2024-08-12T11:35:50.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc3",
      "published_at": "2023-09-26T11:52:51.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc5",
      "published_at": "2023-09-26T12:12:30.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc6",
      "published_at": "2023-10-03T13:22:54.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc7",
      "published_at": "2023-10-03T21:21:02.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc8",
      "published_at": "2023-10-16T13:18:03.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0rc9",
      "published_at": "2023-11-08T15:53:01.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    }
  ]
}