{
  "code_of_conduct_url": null,
  "contributions_count": 0,
  "contribution_guidelines_url": null,
  "dependent_repos_count": 0,
  "dependents_count": 3,
  "deprecation_reason": null,
  "description": "Amplify SDK for Quantum Annealing and Ising Machines",
  "forks": 2,
  "funding_urls": [],
  "homepage": "https://amplify.fixstars.com/",
  "keywords": [
    "quantum",
    "annealing",
    "annealer",
    "machine",
    "QUBO",
    "quadratic",
    "unconstrained",
    "binary",
    "optimization",
    "d-wave",
    "digital",
    "sdk",
    "sbm",
    "simulated",
    "bifurcation",
    "Ising",
    "model",
    "fixstars",
    "amplify",
    "auto-generated",
    "autocomplete",
    "boto3",
    "boto3-stubs",
    "mypy",
    "mypy-stubs",
    "pycharm",
    "python3",
    "type-annotations",
    "typeshed",
    "vscode"
  ],
  "language": "Python",
  "latest_download_url": null,
  "latest_release_number": "1.3.1",
  "latest_release_published_at": "2024-11-18T07:24:22.000Z",
  "latest_stable_release_number": "1.3.1",
  "latest_stable_release_published_at": "2024-11-18T07:24:22.000Z",
  "license_normalized": true,
  "licenses": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
  "name": "amplify",
  "normalized_licenses": [
    "Other"
  ],
  "package_manager_url": "https://pypi.org/project/amplify/",
  "platform": "Pypi",
  "rank": 11,
  "repository_license": "MIT",
  "repository_status": null,
  "repository_url": "",
  "security_policy_url": null,
  "stars": 33,
  "status": null,
  "versions": [
    {
      "number": "0.0.1",
      "published_at": "2020-07-04T15:17:26.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.0.6",
      "published_at": "2020-07-06T08:01:26.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.10.0",
      "published_at": "2022-12-21T20:26:00.515Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.10.1",
      "published_at": "2023-01-20T09:00:02.589Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.10.2",
      "published_at": "2023-02-17T00:54:07.983Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.10.3",
      "published_at": "2023-02-20T01:11:01.092Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.10.4",
      "published_at": "2023-03-15T14:06:26.151Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.1.1",
      "published_at": "2020-07-07T11:09:07.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.11.0",
      "published_at": "2023-04-06T01:25:00.748Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.11.1",
      "published_at": "2023-04-12T00:53:48.485Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.11.2",
      "published_at": "2023-06-24T11:26:00.921Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.1.2",
      "published_at": "2020-07-09T07:25:33.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.12.1",
      "published_at": "2023-11-21T04:41:00.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.1.3",
      "published_at": "2020-07-10T04:38:09.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.1.4",
      "published_at": "2020-07-16T14:43:22.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.1.5",
      "published_at": "2020-08-08T09:08:01.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.1.7",
      "published_at": "2020-08-10T16:14:52.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.2.0",
      "published_at": "2020-09-11T18:26:24.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.2.1",
      "published_at": "2020-09-12T06:24:40.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.2.2",
      "published_at": "2020-10-13T02:01:58.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.3.0",
      "published_at": "2020-12-20T10:58:12.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.3.1",
      "published_at": "2020-12-25T10:28:45.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.3.2",
      "published_at": "2021-01-02T01:48:30.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.3.3",
      "published_at": "2021-01-13T16:07:33.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.3.4",
      "published_at": "2021-01-20T23:49:49.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.4.0",
      "published_at": "2021-01-29T13:00:03.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.4.1",
      "published_at": "2021-02-03T05:12:21.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.5.0",
      "published_at": "2021-05-13T22:16:26.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.5.10",
      "published_at": "2021-06-17T15:51:28.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.5.13",
      "published_at": "2021-07-04T11:16:14.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.5.2",
      "published_at": "2021-05-29T04:09:26.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.5.3",
      "published_at": "2021-06-01T00:57:49.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.5.4",
      "published_at": "2021-06-01T18:30:24.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.5.5",
      "published_at": "2021-06-03T19:08:39.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.5.6",
      "published_at": "2021-06-07T13:58:20.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.5.8",
      "published_at": "2021-06-13T06:54:34.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.5.9",
      "published_at": "2021-06-16T01:02:48.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.6.1",
      "published_at": "2021-08-19T02:26:54.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.6.2",
      "published_at": "2021-09-02T01:54:52.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.6.3",
      "published_at": "2021-09-12T12:43:04.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.6.4",
      "published_at": "2021-09-29T04:54:34.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.6.5",
      "published_at": "2021-10-09T14:17:19.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.6.6",
      "published_at": "2022-02-21T14:50:53.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.7.0",
      "published_at": "2022-04-27T11:04:46.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.8.0",
      "published_at": "2022-06-13T20:41:26.000Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.8.1",
      "published_at": "2022-07-13T11:00:17.671Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.9.0",
      "published_at": "2022-10-04T23:13:24.238Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "0.9.1",
      "published_at": "2022-10-06T15:35:12.933Z",
      "spdx_expression": "NONE",
      "original_license": "",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.0",
      "published_at": "2024-01-27T11:21:16.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.1",
      "published_at": "2024-02-09T16:04:38.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.2",
      "published_at": "2024-02-19T19:39:06.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.3",
      "published_at": "2024-03-01T15:24:36.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.4",
      "published_at": "2024-03-17T02:55:00.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.0.5",
      "published_at": "2024-03-19T10:55:24.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.1.0",
      "published_at": "2024-05-14T22:15:23.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.1.1",
      "published_at": "2024-05-28T11:24:23.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.2.0",
      "published_at": "2024-07-25T05:51:23.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.2.1",
      "published_at": "2024-08-06T06:10:43.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.3.0",
      "published_at": "2024-11-02T00:12:42.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "1.3.1",
      "published_at": "2024-11-18T07:24:22.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "Terms of Use ________________________________________ These Terms of Use stipulate the terms and conditions for the granting of licenses by Fixstars Amplify Corporation (“we”, “us”, “our”) to the User for use of Fixstars Amplify (“Service”), which provides Users with a software development environment and computational resources for solving mathematical optimization problems. There are two types of Service plans: the “Free plan” with certain restrictions on the scope of use, and the “Paid plan” with no such restrictions. Unless otherwise specified, these Terms apply to both plan types. Before using the Service, the User shall carefully read and agree to the entire text of these Terms of Use. When they click on our website to the effect that they agree to these Terms of Use, or complete the other procedures specified by us, a contract for the use of the Service is established, and the User is deemed to have fully agreed to these Terms of Use.  1. Definitions 1.\tThe terms used in these Terms of Use, in addition to those defined in the preamble, shall have the meanings ascribed to them below. (1)\t“Fixstars Amplify SDK” means a set of software tools for developing software to solve mathematical optimization problems. This includes sample programs provided by us. (2)\t“Developed Program” means a program developed using Fixstars Amplify SDK. (3)\t“Fixstars Amplify Cloud” means the service that provides computing resources specified by us, including Fixstars Amplify Annealing Engine, Fixstars Amplify Scheduling Engine and Fixstars Amplify API. (4)\t“Access Token” means a token necessary for use of Fixstars Amplify Cloud. 2.\tThe Services shall include the provision of Fixstars Amplify SDK, Fixstars Amplify Cloud, and other services specified by us.  2. Application of Terms of Use 1.\tIf we post rules regarding the use of the Service on our website, such rules shall form part of these Terms of Use. 2.\tIf the content of these Terms of Use differs from the rules of the preceding paragraph, the provisions of these Terms of Use shall take precedence. 3.\tWe reserve the right to change these Terms of Use if we find it necessary. If we change these Terms of Use, we will inform User of the content and effective date of these Terms of Use after the change by posting on the Service website or another appropriate method, or by notifying User. 4.\tWhen using an engine or other program provided by a third party other than us in the environment provided by the Service, User shall comply with the terms of use, etc., stipulated by such third party. We shall not be involved in any dispute between User and such third party, and User shall resolve any such dispute at User’s own expense and responsibility.  3. Fixstars Amplify SDK 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify SDK for their own under the conditions stipulated in these Terms of Use. 2.\tFixstars Amplify SDK contains programs developed by third parties. When the User uses Fixstars Amplify SDK, the license conditions (<link>) for these programs also apply. 3.\tCopyrights (including the rights of Articles 21 to 28 of the Copyright Act of Japan) and all other intellectual property rights relating to Fixstars Amplify SDK (including images, videos, audio, texts, programs, ideas, know-how, designs, algorithms, and data relating to the foregoing), belong to us or third parties who have granted licenses to us, and are not transferred to the User by agreeing to these Terms of Use. 4.\tThe User acknowledges that agreeing to this license does not entitle them to receive provision or disclosure of source code for any part of Fixstars Amplify SDK; provided, however, that this does not apply to sample programs and OSS etc. that are voluntarily disclosed by us or that are required to be disclosed under licenses from third parties. 5.\tFixstars Amplify reserves the right to modify Fixstars Amplify SDK to add new features, improve performance, or correct bugs without prior notice to the User. In the event of modification, the User may use the modified version of Fixstars Amplify SDK. Note that we are under no obligation to modify Fixstars Amplify SDK.  4. Fixstars Amplify Cloud 1.\tWe grant the User a non-exclusive, non-sublicensable license to use Fixstars Amplify Cloud for their own under the conditions stipulated in these Terms of Use. 2.\tAccess Tokens distributed to Users are required for the use of Fixstars Amplify Cloud. Users shall appropriately manage Access Tokens to prevent unauthorized access by third parties, and shall not provide, transfer, lend, etc. access tokens to third parties. 3.\t3.4 and 3.5 shall apply mutatis mutandis to intellectual property rights relating to the Fixstars Amplify Cloud. 4.\tWe may change the contents of Fixstars Amplify Cloud (including adding or replacing engines, changing specifications, etc.) without prior notice to Users. We disclaim any warranties for the operation of the previous Developed Programs, even after changes of the contents of Fixstars Amplify Cloud. Further, we are not obligated to change the contents of Fixstars Amplify Cloud. 5.\tWe reserve the right to suspend or interrupt the provision of all or part of Fixstars Amplify Cloud without prior notice to Users in any of the following cases. i.\tWhen carrying out maintenance work; ii.\tWhen Fixstars Amplify Cloud cannot be provided stably because of communication line failure, unauthorized access, software failure, hardware failure, or other reasons; iii.\tWhen a defect occurs because of a failure in the service of a third party necessary for providing Fixstars Amplify Cloud or other reasons not attributable to us; and iv.\tIf we otherwise determine that suspension or interruption is necessary.  5. Fees 1.\tUsers with a Pro plan shall pay the usage fees specified by us by the method specified by us in order to use the Service. We will not be obligated for any reason to refund usage fees paid by Users unless otherwise provided in these Terms of Use. 2.\tUsers with a Trial plan may use the Service only for the purpose of operation verification and may not use the Service for the Users' business or operations; provided, however, that the User may use the Service as educational materials for educational purposes at educational institutions (elementary schools, junior high schools, compulsory education schools, high schools, secondary education schools, special needs schools, universities, and technical colleges, but not including private programming schools, etc.). Examples of purposes for which users may use the Service are as follows; * Free plan: * For the purpose of testing Fixstars Amplify SDK and not for the User's business or operations.\tFor the purpose of development of software that will be used as an internal system or the purpose of development of software, whether or not for sale. * For the purpose of education and use as educational material in Educational institutions.\tFor the purpose of testing the software above. * Paid plan: * For the purpose of R&D works (excluding Educational institutions) * Providing Developed Programs to third parties, whether paid or free of charge.  6. Prohibitions 1.\tUsers shall not engage in any of the followings without our prior consent. i.\tUsing the Services for the purpose of software development, research and development work, or for any purpose other than those described in the proviso of 5.2; ii.\tEngaging in any act that violates public policy; iii.\tAllowing a third party other than the User (including its officers and employees other than those designated as the person to use the Service if the User is a corporation) to use the Service; iv.\tReproducing all or a part of the program or other offerings provided by the Service for the purpose other than back-up or archive; v.\tUsing the Service to develop malware and other applications that are contrary to public order and morals or are illegal; vi.\tUsing the Service for any act of violation of laws and regulations, criminal acts, or infringes the rights of us or third parties; vii.\tAltering or modifying all or part of the program or other offerings provided by the Service; provided, however, that this shall not apply to sample programs and other items designated by us, which may be altered or modified within the scope of the terms and conditions included with such items; viii.\tIncorporating all or part of the program or other offerings provided by the Service into part of other software, or incorporating all or part of other software into part of the Service; ix.\tAnalyzing the structure, functions, or processing methods etc. of the Service by tracing, debugging, disassembling, reverse engineering, decompiling, or other means, or attempting to obtain the source code of all or part of the program provided by the Service; x.\tAssigning, renting, leasing, sublicensing, or creating a security interest in rights granted to the User in accordance with these Terms of Use to a third party; xi.\tPublishing a copy of the program or other offerings provided by the Service on a computer network that can be accessible by a third party; xii.\tUnauthorized computer access, cracking, overloading, or any other actions that may cause malfunction of this service or interfere with the operation of this Service; xiii.\tUnauthorized computer access to our network or system, etc.; xiv.\tProviding, transferring, or lending access tokens to a third party; and xv.\tOther use of the Services beyond the scope permitted by these Terms of Use. 2.\tUsers shall permit audits by us or third parties entrusted by us and provide necessary cooperation in order to confirm compliance with the provisions of these Terms of Use. We will bear audit expenses unless a breach of the provisions of these Terms of Use is found. 3.\tWe reserve the right to limit or suspend the use of the Service without prior notice if we determine that any conduct set forth in 6.1 or any other conduct breaching these Terms of Use has occurred. We will not be liable for any damage caused to users as a result of the suspensions or limitations in this paragraph.  7. Use environment When using the Service, Users shall prepare the computer environment specified by us, including computer terminals and communication lines, at their own expense and responsibility. We are not responsible for Users’ environments or deficiencies in equipment, software, etc. that are not under our control.  8. Warranty 1.\tWe shall not be liable with respect to whether the use of the Service suits any particular purpose of Users, whether it has the expected functions, merchantability, accuracy, completeness, or usefulness, whether the processing results etc. are accurate, whether it can be used continuously, or whether any deficiencies will not arise. 2.\tWe shall not be liable even if Users suffer damage or problems occur with respect to the Service due to any earthquake, lightning strike, fire, storm or flood, earthquake, power outage, natural disaster, or other force majeure, act by third parties or other accident, willful misconduct, negligence, or misuse by Users, or use under other abnormal conditions.  9. Limitation of liability 1.\tExcept in the event of willful misconduct or gross negligence by us, we shall not be liable for any damage (including profits, data loss and damage, other financial damage, and damage caused to third parties) resulting from the use of or inability to use the Service. 2.\tIn the event of damage suffered by a User because of willful misconduct or gross negligence by us, we will not be liable for compensation in excess of the total amount of usage fees paid to us by the User in the past six months (10,000 yen for a Trial plan), and we shall not be held liable to compensate for any incidental damage, indirect damage, special damage, future damage, or lost profits. 3.\tThe provisions of the preceding paragraphs will not apply if the agreement between us and Users under these Terms of Use falls under a consumer contract as specified in the Consumer Contract Act (Law No. 61 of 2000) (“Consumer Contract”); provided, however, that even if this paragraph applies, with respect to liability for default or tort due to negligence (excluding gross negligence) by us, our liability for damages to Users shall be limited to the scope of direct and ordinary damage, up to the amount specified in 9.2, and we will not be liable for indirect damage, special damage, lost profits, or other damage due to special circumstances regardless of whether it is foreseeable or predictable.  10. Support 1.\tWe will provide support to Users in relation to the Service by the method specified by us; provided, however, that all such support shall be provided online (by chat), and we are not obligated to respond to all User questions and requests within a certain period of time. 2.\tTerms and conditions of supports for Pro plan Users will be specified separately.  11. User registration 1.\tUsers are required to complete user registration with us in order to use the Service (however, registration is optional for Trial plans). We will appropriately handle personal information collected by us in accordance with the privacy policy of our group company (https://www.fixstars.com/en/privacy/  ).  12. Termination of the contract for use of the Service and the Service 1.\tWe may terminate the contract for use of the Service if any of the following events occurs: i.\tThe User fails to comply with any of the provisions hereof; ii.\tThe User undergoes payment suspension or becomes insolvent, or a petition for bankruptcy, civil rehabilitation, corporate reorganization, special liquidation or other similar procedure was filed against the User; iii.\tThe User has not used the Service for 6 months or more; iv.\tThe User has not responded to inquiries from us or other communications requiring a response for 30 days or more; and v.\tIf a User engages in any other serious breach of trust. 2.\tWhen we determine that the Service cannot be continued, we may terminate the provision of the Service by making an announcement on our website at least one month in advance. 3.\tThe User may terminate the contract for use of the Service upon completion of the procedures prescribed by us; provided, however, that upon termination from the Service, any and all debt of the User to us, if any, shall automatically become due and payable, and the User shall immediately pay to us such debts in full. 4.\tOnce the contract for use of the Service has expired for any reason, the User will no longer be able to use the Service and will delete Fixstars Amplify SDK and Access Token.  13. Exclusion of Antisocial Forces etc. 1.\tWe and Users shall each represent to each other the matters set forth in the following items, and covenant the same to each other into the future. i.\tThat neither it nor its officers (including both actual officers and persons with substantive managerial control; hereinafter the same), agents, or intermediaries constitute Antisocial Forces; ii.\tThat neither it nor its officers make use of Antisocial Forces; iii.\tThat neither it nor its officers are cooperating or involved in the maintenance or operation of Antisocial Forces, such as by providing funds etc. or conveniences thereto; iv.\tThat neither it nor its officers have socially condemnable relationships or other close relationships or interactions with Antisocial Forces; and v.\tThat it will not directly or through third parties use violence, fraudulent means, or threatening language against the other party, tell such other party that they or their affiliates are Antisocial Forces or affiliates of Antisocial Forces, engage in conduct which will or may defame the honor or reputation of such other party, or engage in conduct which will or may obstruct the business of such other party. 2.\tWe and Users, if it comes to light that it has breached or may have breached the items of the preceding paragraph, shall immediately notify the other party. 3.\tIf circumstances raising reasonable suspicion of a breach of any item of Paragraph 1 come to light in respect of us or a User and a reasonable explanation for the same is not given, the other party will be entitled to cancel all formal and informal agreements between us and such User, including Agreements, without need of any warning whatsoever. 4.\tWhen an agreement between us and a User is cancelled under the provisions of the preceding paragraph, all damage suffered by the party that cancelled the agreement shall be indemnified by the other party. 5.\tWhen an agreement between us and a User is cancelled under the provisions of Paragraph 3, the party that did not cancel the agreement shall make no claims to the party that cancelled the agreement for any damage suffered because of such cancellation.  14. Compliance with export regulations Users shall comply with laws, orders, rules, and other regulations relating to export controls (“Export Regulations”) applicable to the Service in Japan and other applicable countries, and must not use the Service in a manner that violates Export Regulations. We shall not be liable for any hindrance or damage caused by claims or litigation by third parties because of a violation of Export Regulations stemming from the use of the Service by Users.  15. Assignment etc. of contractual status pursuant to these Terms 1.\tUsers shall not assign, transfer, create a security interest in, or otherwise dispose of their contractual status pursuant to these Terms of Use or their rights or duties hereunder to a third party without our prior written consent. 2.\tIf we transfer business relating to the Service to another entity, in conjunction with such transfer of business, we may assign our contractual status pursuant to these Terms of Use, our rights and duties hereunder, User’s registration information, and other User information to the assignee of such transfer of business, and Users are hereby deemed to have consented to such assignment in advance. A transfer of business as specified in this paragraph shall include not only a transfer of business but also a company split and any other case where business is transferred.  16. Severability Even if any provision of these Terms of Use or a part thereof is determined to be invalid or unenforceable in accordance with laws and regulations etc., the remaining provisions of these Terms of Use and the remaining portions of the provisions determined to be invalid or unenforceable shall continue to be in full force.  17. Generals 1.\tThe Japanese language version of these Terms of Use shall be the original version. In the event of any contradiction or conflict between a version hereof translated into another language and the Japanese version, the Japanese version shall prevail. 2.\tThese Terms of Use shall be governed by the laws of Japan 3.\tThe Tokyo District Court shall be the exclusive court of first instance for any litigation arising in connection with matters stipulated in these Terms of Use or the Service.  Enacted: February 1, 2021 Last updated: March 17, 2023  ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    }
  ]
}