{
  "code_of_conduct_url": null,
  "contributions_count": 0,
  "contribution_guidelines_url": null,
  "dependent_repos_count": 0,
  "dependents_count": 2,
  "deprecation_reason": null,
  "description": "AutoDL framework for neural network compression & acceleration",
  "forks": 0,
  "funding_urls": null,
  "homepage": "https://enot.ai",
  "keywords": [
    "AI",
    "Neural",
    "architecture",
    "search"
  ],
  "language": null,
  "latest_download_url": null,
  "latest_release_number": "3.7.2",
  "latest_release_published_at": "2024-06-29T22:53:50.000Z",
  "latest_stable_release_number": "3.7.1",
  "latest_stable_release_published_at": "2024-05-14T15:24:46.000Z",
  "license_normalized": true,
  "licenses": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
  "name": "enot-autodl",
  "normalized_licenses": [
    "Other"
  ],
  "package_manager_url": "https://pypi.org/project/enot-autodl/",
  "platform": "Pypi",
  "rank": 6,
  "repository_license": null,
  "repository_status": null,
  "repository_url": null,
  "security_policy_url": null,
  "stars": 0,
  "status": null,
  "versions": [
    {
      "number": "2.10.0",
      "published_at": "2022-04-14T08:48:10.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.11.0",
      "published_at": "2022-05-01T23:16:31.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.12.0",
      "published_at": "2022-05-23T22:35:37.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.13.0",
      "published_at": "2022-07-08T20:05:00.400Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.14.0",
      "published_at": "2022-09-20T00:43:37.819Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.15.0",
      "published_at": "2022-10-29T17:35:20.447Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.4.2",
      "published_at": "2021-07-01T14:59:30.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.4.3",
      "published_at": "2021-07-28T07:57:16.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.5.0",
      "published_at": "2021-08-19T22:52:12.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.5.1",
      "published_at": "2021-08-24T10:48:05.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.6.0",
      "published_at": "2021-09-30T04:48:49.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.7.0",
      "published_at": "2021-12-17T15:14:20.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.8.0",
      "published_at": "2022-02-04T04:30:39.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.9.0",
      "published_at": "2022-03-04T15:12:01.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "2.9.2",
      "published_at": "2022-03-16T16:39:35.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.0.0",
      "published_at": "2022-11-28T22:19:01.018Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.1.0",
      "published_at": "2023-01-24T03:10:48.733Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.2.0",
      "published_at": "2023-02-07T10:50:03.099Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.2.5",
      "published_at": "2023-04-05T06:20:00.368Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.3.0",
      "published_at": "2023-04-20T14:25:00.470Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.3.1",
      "published_at": "2023-05-10T14:45:00.761Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.3.2",
      "published_at": "2023-07-15T09:31:15.555Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.3.3",
      "published_at": "2023-09-12T16:45:12.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.4.0",
      "published_at": "2023-07-29T17:45:54.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.4.1",
      "published_at": "2023-08-11T20:31:44.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.4.2",
      "published_at": "2023-08-21T17:14:56.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.4.3",
      "published_at": "2023-09-01T18:57:38.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.4.4",
      "published_at": "2023-09-08T14:58:14.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.4.5",
      "published_at": "2023-09-09T00:00:02.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.4.6",
      "published_at": "2023-09-11T18:03:47.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.4.7",
      "published_at": "2023-10-16T21:13:03.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.4.8",
      "published_at": "2023-11-09T17:12:12.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.5.0",
      "published_at": "2023-11-21T14:49:20.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.5.1",
      "published_at": "2023-12-27T10:51:26.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.5.2",
      "published_at": "2024-02-15T14:04:18.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.6.0",
      "published_at": "2024-02-24T09:10:15.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.7.1",
      "published_at": "2024-05-14T15:24:46.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    },
    {
      "number": "3.7.2",
      "published_at": "2024-06-29T22:53:50.000Z",
      "spdx_expression": "NOASSERTION",
      "original_license": "ENOT License v1.0  IMPORTANT, PLEASE READ CAREFULLY:  THIS END USER LICENSE AGREEMENT “EULA” IS A LEGAL AGREEMENT BETWEEN YOU (AS AN INDIVIDUAL OR ENTITY, “YOU” THE “CUSTOMER”) AND ENOT (“SIA ENOT”), FOR PRODUCTS AND SERVICES, WHICH MAY INCLUDE COMPUTER SOFTWARE AND ASSOCIATED DOCUMENTATION (“SOFTWARE”). BY INSTALLING OR OTHERWISE USING THE SOFTWARE OR RECEIVING THE SERVICES, YOU AGREE TO BE BOUND BY THE TERMS OF THIS EULA. IF YOU DO NOT AGREE WITH THE TERMS OF THIS EULA, DO NOT USE THE SOFTWARE OR SERVICES.  1.0 License Grant. This EULA grants you, the user, a non-exclusive, non-transferable license to use the Software, in object code for your internal business purposes (and not for managing third party data unless the product you have licensed expressly permits you to) under the terms and conditions stated herein. The Software is to be installed, used, and deployed in accordance with the specific license you purchased. This EULA and the Licensing Policy can be updated from time to time, in ENOT’s sole discretion and will be made available at www.enot.ai.  2.0 Permissible Use. You may use the Software for the number of licenses or capacity that you have purchased. You are permitted to make copies of the Software and documentation for your own use in accordance to EULA and Licensing Policy. Any copies or partial copies of Software and documentation that you make must incorporate all patent, copyright and trademark notices.  3.0 Prohibited Use. You may not (a) process third party data (as a service provider), provide commercial hosting services, sell, sublicense, rent or lease the Software to another party without purchasing the specific ENOT license to do so, (b) decompile, disassemble, reverse engineer or modify in any manner, any of the Software (except to the extent such prohibition is expressly prohibited by law), (c) use the Software in violation of any applicable laws or regulations, or (d) make available the Software or your license file on any type of public sharing website or forums. The restrictions on using the Software to process the data of third parties, provide commercial hosting services, sublicense, rent or lease the Software does not apply to those participants of the ENOT Cloud & Service Provider Program (\"VCSP Program\"), granted the rental license to use the Software under the terms of the VCSP Program. You agree that you may not disclose, transfer or otherwise make available the results of any performance or functionality tests of the Software, to any third party without the prior written consent of ENOT.  4.0 Evaluation and “Not for Resale” Licenses. Software may be provided to you for beta, demonstration, test or evaluation purposes, or is labeled as “Not for Resale” (“NFR”). The license granted under an Evaluation, Beta or NFR license shall be for a term of thirty (30) days (the “Evaluation Period”) unless otherwise provided by ENOT, limited specifically for evaluation or demonstration purposes only. You agree not to use the Software under an Evaluation License in a production environment or for production data processing purposes and your use of a Beta or Evaluation License Software is at your sole risk to backup data. There is no obligation to support, maintain or provide any assistance regarding any of these licenses. In no event will ENOT be liable for any damages for any claim or cause for any direct, actual, indirect damages, loss of data, consequential, incidental or special indirect damages, even if ENOT has been advised of the possibility of such damages.  5.0 Maintenance and Support. Maintenance and Support (“Maintenance”) for the Software is available in accordance with Licensing policy and Support Policy, which can be requested via email enot@enot.ai. Maintenance, if it is included in the Software purchased, will commence upon the date your order is processed and the license file is generated. You will receive (a) support for your Software, and (b) any updates, enhancements or improvements that are included or defined in the Maintenance Policies. Software updates cannot be applied to the Software with an expired Maintenance.  6.0 Technical Information Collection. You agree that ENOT may, for business purposes and improving the Software, collect, process and use technical information that is gathered as part of any product maintenance and support services provided to you, and any other technical information you provide to ENOT, provided that such information does not identify You, a specific individual, or contain any personally identifiable information. By providing technical data and information to ENOT, you consent to ENOT’s storage and processing of such technical information for purposes of providing Software and support to you.  7.0 Personal Information. In the event you provide personal information to ENOT as part of your purchase and use of the Software, or for obtaining Maintenance, your personal information will be used, stored and processed in accordance with the ENOT Privacy Policy.  8.0 Capacity Limitations in Software. For certain Software, your use of the Software may be limited by the capacity purchased. In the event you exceed the purchased capacity, the Software may not process additional workloads beyond the maximum capacity until you purchase additional capacity.  9.0 Intellectual Property Rights. All right, title and interest to the intellectual property rights in and to the Software, and any copies that you are permitted to make, are owned by ENOT and / or its licensors and is protected by Swiss, United States and other country patent, copyright, trade secret and other laws and international treaties. Such licensors, in addition to any other rights or remedies available to them, are third party beneficiaries of this EULA for their respective software. This Software is LICENSED, NOT SOLD. The purchase of the Software license (perpetual or subscription), is non-returnable and non-refundable. The Software is protected by patents, and certain trademarks and logos used in the software are protected by trademarks.  10.0 Audit. During the term of this Agreement and for a period of one year there after, ENOT may, during normal business hours and upon reasonable prior notice to End User, inspect the files, computer processors, equipment and facilities of End User to verify End User's compliance with this EULA.  11.0 Limited Warranty and Limitation of Liability. ENOT warrants that it has the right and authority to grant the License under this EULA. ENOT will defend or, at its option, settle any action against End User based upon a claim that its use of the Software infringes any patent, copyright or other intellectual property right of a third party, and will indemnify End User against any amounts awarded against End User as a result of the claim, provided ENOT is promptly notified of the assertion of the claim and has control of its defense or settlement. ENOT warrants that the Software, in its unmodified form as initially delivered or made available to End User, will perform substantially in accordance with the Documentation for a warranty period of ninety (90) days from the date the Software is delivered to End User. This warranty does not apply to Licenses under sections 4.0 and 5.0. In the event the Software fails in a material respect to operate in accordance with the Documentation during the warranty period and ENOT is unable to correct the defect, ENOT’s sole and exclusive liability and End User’s sole and exclusive remedy shall be a refund of the License fee, if any, paid by End User for the Software. In the event a reported problem with the Software is End User’s fault, End User agrees to reimburse ENOT for its correction efforts in accordance with its then standard rates. The foregoing limited warranty will not apply if failure of the Software is the result of damage or misuse caused by End User. EXCEPT FOR THE LIMITED WARRANTY SET FORTH ABOVE, THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY THAT THE SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE OR FIT FOR A PARTICULAR PURPOSE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY ENOT OR ANY THIRD PARTY, INCLUDING, WITHOUT LIMITATION, ANY ENOT DISTRIBUTORS OR RESELLERS, SHALL CREATE ANY WARRANTY IN ADDITION TO, OR IN ANY WAY INCREASE THE SCOPE OF, THE LIMITED WARRANTY. In no event will ENOT, its affiliates, resellers, or distributors or suppliers be liable for any indirect, special, incidental or consequential damages arising out of the use of or inability to use the Software, including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if advised of the possibility thereof.  12.0 General. This Agreement sets forth ENOT's entire obligation and End User’s exclusive rights with respect to the Software and, except to the extent otherwise specifically provided in a purchase order or other written communication or advertising signed or jointly issued by both parties with respect to the Software, supersedes any conflicting terms of any purchase order and any other communication or advertising with respect to the Software. No failure of either party to exercise or enforce any of its rights under this EULA will act as a waiver of those rights. If any provision of this EULA is found illegal or unenforceable, it will be enforced to the maximum extent permissible, and the legality and enforceability of the other provisions of this EULA will not be affected. This EULA will be governed by the laws of Switzerland, without regard to its choice of law principles. You agree that exclusive jurisdiction for any claim or dispute arising out of or in connection with this EULA resides in the Latvia. This Agreement and the underlying licenses may not be assigned without completely removing the software installation from the assignor, notifying and providing ENOT with the assignee contact information (for support purposes), and is subject to the assignee agreeing to and complying with the terms and conditions of this Agreement and the Licensing Policy. ",
      "researched_at": null,
      "repository_sources": [
        "Pypi"
      ]
    }
  ],
  "dependencies_for_version": "3.7.2",
  "dependencies": [
    {
      "project_name": "torch",
      "name": "torch",
      "platform": "Pypi",
      "requirements": "<2.4.0,>=1.10.0",
      "latest_stable": "2.5.1",
      "latest": "2.5.1",
      "deprecated": false,
      "outdated": true,
      "filepath": null,
      "kind": "runtime",
      "optional": false,
      "normalized_licenses": [
        "BSD-3-Clause"
      ]
    },
    {
      "project_name": "torchvision",
      "name": "torchvision",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "0.20.1",
      "latest": "0.20.1",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "runtime",
      "optional": false,
      "normalized_licenses": [
        "BSD-3-Clause"
      ]
    },
    {
      "project_name": "numpy",
      "name": "numpy",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "2.2.1",
      "latest": "2.2.1",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "runtime",
      "optional": false,
      "normalized_licenses": [
        "Other"
      ]
    },
    {
      "project_name": "networkx",
      "name": "networkx",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "3.4.2",
      "latest": "3.4.2",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "runtime",
      "optional": false,
      "normalized_licenses": [
        "BSD-3-Clause"
      ]
    },
    {
      "project_name": "pulp",
      "name": "pulp",
      "platform": "Pypi",
      "requirements": "==2.4",
      "latest_stable": "2.9.0",
      "latest": "2.9.0",
      "deprecated": false,
      "outdated": true,
      "filepath": null,
      "kind": "runtime",
      "optional": false,
      "normalized_licenses": [
        "BSD-3-Clause"
      ]
    },
    {
      "project_name": "tabulate",
      "name": "tabulate",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "0.9.0",
      "latest": "0.9.0",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "runtime",
      "optional": false,
      "normalized_licenses": [
        "MIT"
      ]
    },
    {
      "project_name": "tqdm",
      "name": "tqdm",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "4.67.1",
      "latest": "4.67.1",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "runtime",
      "optional": false,
      "normalized_licenses": [
        "MPL-2.0",
        "MIT"
      ]
    },
    {
      "project_name": "botorch",
      "name": "botorch",
      "platform": "Pypi",
      "requirements": "<0.8.0,>=0.4.0",
      "latest_stable": "0.12.0",
      "latest": "0.12.0",
      "deprecated": false,
      "outdated": true,
      "filepath": null,
      "kind": "runtime",
      "optional": false,
      "normalized_licenses": [
        "MIT"
      ]
    },
    {
      "project_name": "optuna",
      "name": "optuna",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "4.1.0",
      "latest": "4.1.0",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "runtime",
      "optional": false,
      "normalized_licenses": [
        "MIT"
      ]
    },
    {
      "project_name": "onnx2torch",
      "name": "onnx2torch",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "1.5.15",
      "latest": "1.5.15",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "runtime",
      "optional": false,
      "normalized_licenses": [
        "Other"
      ]
    },
    {
      "project_name": "dill",
      "name": "dill",
      "platform": "Pypi",
      "requirements": ">=0.3.1",
      "latest_stable": "0.3.9",
      "latest": "0.3.9",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "runtime",
      "optional": false,
      "normalized_licenses": [
        "BSD-3-Clause"
      ]
    },
    {
      "project_name": "typing-extensions",
      "name": "typing-extensions",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "4.12.2",
      "latest": "4.12.2",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "runtime",
      "optional": false,
      "normalized_licenses": [
        "PSF-2.0"
      ]
    },
    {
      "project_name": "black",
      "name": "black",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "24.10.0",
      "latest": "24.10.0",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "extra == \"dev\"",
      "optional": true,
      "normalized_licenses": [
        "MIT"
      ]
    },
    {
      "project_name": "black[jupyter]",
      "name": "black[jupyter]",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": null,
      "latest": null,
      "deprecated": null,
      "outdated": null,
      "filepath": null,
      "kind": "extra == \"dev\"",
      "optional": true,
      "normalized_licenses": null
    },
    {
      "project_name": "enot-prunable-modules[dev]",
      "name": "enot-prunable-modules[dev]",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": null,
      "latest": null,
      "deprecated": null,
      "outdated": null,
      "filepath": null,
      "kind": "extra == \"dev\"",
      "optional": true,
      "normalized_licenses": null
    },
    {
      "project_name": "fvcore",
      "name": "fvcore",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "0.1.4",
      "latest": "0.1.5.post20221221",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "extra == \"dev\"",
      "optional": true,
      "normalized_licenses": [
        "Apache-2.0"
      ]
    },
    {
      "project_name": "nbmake",
      "name": "nbmake",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "1.5.5",
      "latest": "1.5.5",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "extra == \"dev\"",
      "optional": true,
      "normalized_licenses": [
        "Apache-2.0"
      ]
    },
    {
      "project_name": "pytest",
      "name": "pytest",
      "platform": "Pypi",
      "requirements": "<8.1",
      "latest_stable": "8.3.4",
      "latest": "8.3.4",
      "deprecated": false,
      "outdated": true,
      "filepath": null,
      "kind": "extra == \"dev\"",
      "optional": true,
      "normalized_licenses": [
        "MIT"
      ]
    },
    {
      "project_name": "pre-commit",
      "name": "pre-commit",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "4.0.1",
      "latest": "4.0.1",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "extra == \"dev\"",
      "optional": true,
      "normalized_licenses": [
        "MIT"
      ]
    },
    {
      "project_name": "tensorboard",
      "name": "tensorboard",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "2.18.0",
      "latest": "2.18.0",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "extra == \"dev\"",
      "optional": true,
      "normalized_licenses": [
        "Apache-2.0"
      ]
    },
    {
      "project_name": "pyyaml",
      "name": "pyyaml",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "6.0.2",
      "latest": "6.0.2",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "extra == \"dev\"",
      "optional": true,
      "normalized_licenses": [
        "MIT"
      ]
    },
    {
      "project_name": "onnx",
      "name": "onnx",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "1.17.0",
      "latest": "1.17.0",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "extra == \"dev\"",
      "optional": true,
      "normalized_licenses": [
        "Apache-2.0"
      ]
    },
    {
      "project_name": "onnxsim",
      "name": "onnxsim",
      "platform": "Pypi",
      "requirements": "*",
      "latest_stable": "0.4.36",
      "latest": "0.4.36",
      "deprecated": false,
      "outdated": false,
      "filepath": null,
      "kind": "extra == \"dev\"",
      "optional": true,
      "normalized_licenses": [
        "Apache-2.0"
      ]
    }
  ]
}